---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilyPlacementType.CurveBasedDetail
enum: Autodesk.Revit.DB.FamilyPlacementType
source: html/2abb8627-1da3-4069-05c9-19e4be5e02ad.htm
---
# Autodesk.Revit.DB.FamilyPlacementType.CurveBasedDetail

The family is based on a line and place on a specific view (e.g. a detail component).